<a href="https://colab.research.google.com/github/welting82/AIclass/blob/main/titanic/titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [8]:
from urllib.request import urlretrieve
url = "https://github.com/welting82/AIclass/raw/main/titanic/test.csv"
urlretrieve(url, "test.csv")
url = "https://github.com/welting82/AIclass/raw/main/titanic/train.csv"
urlretrieve(url, "train.csv")

('train.csv', <http.client.HTTPMessage at 0x7f9a99c37f10>)

In [9]:
import pandas as pd
train = pd.read_csv("train.csv", encoding="utf-8")
test = pd.read_csv("test.csv", encoding="utf-8")

In [10]:
datas = pd.concat([train,test],axis=0,ignore_index=True)
datas = datas.drop(["PassengerId","Survived"],axis=1)

In [11]:
#demo
name = "Braund, Mr. Owen Harris"
name.split(",")[-1].split(".")[0].strip()

'Mr'

In [12]:
def nameflow(name):
  return name.split(",")[-1].split(".")[0].strip()
datas["Name"] = datas["Name"].apply(nameflow)
datas

      Pclass    Name     Sex   Age  ...              Ticket      Fare Cabin  Embarked
0          3      Mr    male  22.0  ...           A/5 21171    7.2500   NaN         S
1          1     Mrs  female  38.0  ...            PC 17599   71.2833   C85         C
2          3    Miss  female  26.0  ...    STON/O2. 3101282    7.9250   NaN         S
3          1     Mrs  female  35.0  ...              113803   53.1000  C123         S
4          3      Mr    male  35.0  ...              373450    8.0500   NaN         S
...      ...     ...     ...   ...  ...                 ...       ...   ...       ...
1304       3      Mr    male   NaN  ...           A.5. 3236    8.0500   NaN         S
1305       1    Dona  female  39.0  ...            PC 17758  108.9000  C105         C
1306       3      Mr    male  38.5  ...  SOTON/O.Q. 3101262    7.2500   NaN         S
1307       3      Mr    male   NaN  ...              359309    8.0500   NaN         S
1308       3  Master    male   NaN  ...                2668   22.3583   NaN         C

[1309 rows x 10 columns]

In [13]:
def cabinflow(cabin):
    if pd.isna(cabin):
        return cabin
    else:
        return cabin[0]
datas["Cabin"] = datas["Cabin"].apply(cabinflow)
datas["Cabin"].value_counts()

C    94
B    65
D    46
E    41
A    22
F    21
G     5
T     1
Name: Cabin, dtype: int64